ПРАВИЛЬНЫЙ_ПАРОЛЬ = "1234"

while True:
    # Запрашиваем пароль у пользователя
    введенный_пароль = input("Введите пароль для входа в систему: ")
    
    # Проверяем, совпадает ли введенный пароль с правильным
    if введенный_пароль == ПРАВИЛЬНЫЙ_ПАРОЛЬ:
        print("Доступ разрешен. Добро пожаловать в систему!")
        break  # Мгновенно прерываем цикл
        
    # Если пароль неверный, этот код сработает, и цикл начнется заново
    print("Неверный пароль. Попробуйте еще раз.\n")